scripts/k6/smoke/smoke-test-cli-report.txt
K6_WEB_DASHBOARD=true K6_WEB_DASHBOARD_EXPORT=scripts/k6/smoke-test-report.html k6 run scripts/k6/smoke.test.js

          /\      |‾‾| /‾‾/   /‾‾/   
     /\  /  \     |  |/  /   /  /    
    /  \/    \    |     (   /   ‾‾\  
   /          \   |  |\  \ |  (‾)  | 
  / __________ \  |__| \__\ \_____/ .io

     execution: local
        script: scripts/k6/smoke.test.js
 web dashboard: http://127.0.0.1:5665
        output: -

     scenarios: (100.00%) 1 scenario, 5 max VUs, 1m30s max duration (incl. graceful stop):
              * default: 5 looping VUs for 1m0s (gracefulStop: 30s)


     data_received..................: 265 MB  4.4 MB/s
     data_sent......................: 92 MB   1.5 MB/s
     http_req_blocked...............: min=520ns    med=1.13µs   avg=1.24µs   p(90)=1.59µs   p(95)=1.8µs    max=585.5µs  count=1005218
     http_req_connecting............: min=0s       med=0s       avg=0ns      p(90)=0s       p(95)=0s       max=121.24µs count=1005218
     http_req_duration..............: min=131.3µs  med=231.47µs avg=264.46µs p(90)=332.67µs p(95)=409.97µs max=114.24ms count=1005218
       { expected_response:true }...: min=208.95µs med=325.41µs avg=389.75µs p(90)=499.68µs p(95)=602.65µs max=7.75ms   count=6600   
     ✓ { status:200 }...............: min=208.95µs med=325.41µs avg=389.75µs p(90)=499.68µs p(95)=602.65µs max=7.75ms   count=6600   
     ✓ { status:429 }...............: min=131.3µs  med=231.18µs avg=263.63µs p(90)=330.29µs p(95)=407.52µs max=114.24ms count=998618 
     ✓ { status:500 }...............: min=0s       med=0s       avg=0s       p(90)=0s       p(95)=0s       max=0s       count=0      
     http_req_failed................: 99.34%  ✓ 998618       ✗ 6600
     http_req_receiving.............: min=6.48µs   med=17.53µs  avg=18.19µs  p(90)=24.15µs  p(95)=26.77µs  max=3.44ms   count=1005218
     http_req_sending...............: min=2.5µs    med=5.34µs   avg=5.6µs    p(90)=7.2µs    p(95)=8.04µs   max=5.93ms   count=1005218
     http_req_tls_handshaking.......: min=0s       med=0s       avg=0s       p(90)=0s       p(95)=0s       max=0s       count=1005218
     http_req_waiting...............: min=113.25µs med=207.94µs avg=240.66µs p(90)=306.54µs p(95)=381.84µs max=114.2ms  count=1005218
     http_reqs......................: 1005218 16753.447204/s
     iteration_duration.............: min=342.87µs med=529.66µs avg=590.6µs  p(90)=728.73µs p(95)=864.94µs max=114.84ms count=502609 
     iterations.....................: 502609  8376.723602/s
     vus............................: 5       min=5          max=5 
     vus_max........................: 5       min=5          max=5 


running (1m00.0s), 0/5 VUs, 502609 complete and 0 interrupted iterations
default ✓ [======================================] 5 VUs  1m0s